УТ/src/Catalogs/CRM_ПланПродаж/CRM_ПланПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ПланПродаж</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СхемаПланаПродаж</name>
    <type>
      <types>CatalogRef.CRM_СхемаПланаПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьНомерНедели</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КратностьЗначений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДробнаяЧасть</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКоличество</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСумму</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.CRM_ЕдиницыИзмеренияПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеВерхнегоУровня</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПолученияФакта</name>
    <type>
      <types>EnumRef.CRM_ВариантыПолученияФактаПродажи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Администраторы</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Enums/CRM_ВариантыПолученияФактаПродажи/CRM_ВариантыПолученияФактаПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВариантыПолученияФактаПродажи</name>
  <enumValues>
    <name>ПоВыручке</name>
  </enumValues>
  <enumValues>
    <name>ПоОплате</name>
  </enumValues>
  <enumValues>
    <name>Меньшее</name>
  </enumValues>
</mdclass:Enum>

УТ/src/Catalogs/CRM_ПланПродаж/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнениеВариантаПолученияФакта() Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
	     |	CRM_ПланПродаж.Ссылка КАК Ссылка
	     |ИЗ
	     |	Справочник.CRM_ПланПродаж КАК CRM_ПланПродаж
	     |ГДЕ
	     |	CRM_ПланПродаж.ВариантПолученияФакта = ЗНАЧЕНИЕ(Перечисление.CRM_ВариантыПолученияФактаПродажи.ПустаяСсылка)");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОб = Выборка.Ссылка.ПолучитьОбъект();
		СпрОб.ВариантПолученияФакта = Перечисления.CRM_ВариантыПолученияФактаПродажи.ПоВыручке;
		СпрОб.ОбменДанными.Загрузка = Истина;
		СпрОб.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
